2014-09-22
http://www.mitbbs.com/article_t/JobHunting/32766361.html


A家：找的朋友递的简历，3月初电面，3月底onsite。
电面一轮两道题：1 两数和；2 二叉树是否为二叉搜索树。
onsite：
1.1 复制带有随机指针的链表
1.2 又是isBST，不过这次不让用recursive的方法
2.1 找小于N的素数
2.2 BST里第二大的数
3.1 类似text justification，但不用添加多余的空格，只用加n
3.2 实现priority queue
4.1 开始扯了很多小题目，最后用链表写stack和queue

F家：版上的大哥帮忙递的简历，感谢！
电面也是一轮两道题：
1 字母矩阵里找给定的单词 
2 两个单词是否只差一个字母，可以删除，修改和添加
onsite：
1.1 给一次读4096B的函数，实现一个读取文件到给定文件的函数。在网上搜read4096
就有很多讨论了。
1.2 对一个图像做水平对称，功能函数是每次要把1B的数据对称。比如
1001110100100001->1000010010111001。
2.1 三数之和为0
2.2 给定圆心和半径，改变圆上像素的值。假设有一个网格，格点坐标都是整数，像素
就是边长为1的方块。例子：给定圆心是0,0  半径是5，要把圆经过的所有像素找出来
。比如(2,2)(2,3)(3,3)(3,2)这4个点
就是像素的4个顶点，这个像素符合被圆经过的条件。
3    设计arithmetic expression tree，节点可以是int，symbol或者operator。要求
实现能根据符号表把树简化。比如树是a+b+c的话，给表里有a＝2，c＝1，那要简化成b
+3。这个我觉得我基本没答出他想要的。
4    聊天很久，然后写了一个从string里去掉某一个字符
